BAS BMEKZU Project/src/Documents/ИНАГРО_ВводСведенийДляРасчетаСтраховогоСтажа/ИНАГРО_ВводСведенийДляРасчетаСтраховогоСтажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИНАГРО_ВводСведенийДляРасчетаСтраховогоСтажа</name>
  <registerRecords>InformationRegister.ИНАГРО_СтраховойСтажПоДаннымПФУ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СтраховойСтаж</name>
    <attributes>
      <name>Год</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Месяц1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Месяц2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Месяц3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Месяц4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Месяц5</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Месяц6</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Месяц7</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Месяц8</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Месяц9</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Месяц10</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Месяц11</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Месяц12</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоМесяцев</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолныйМесяц1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолныйМесяц2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолныйМесяц3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолныйМесяц4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолныйМесяц5</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолныйМесяц6</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолныйМесяц7</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолныйМесяц8</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолныйМесяц9</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолныйМесяц10</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолныйМесяц11</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолныйМесяц12</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоДнейНеполногоМесяца</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/InformationRegisters/ИНАГРО_СтраховойСтажПоДаннымПФУ/ИНАГРО_СтраховойСтажПоДаннымПФУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИНАГРО_СтраховойСтажПоДаннымПФУ</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДниСтажа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МесяцыСтажа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Documents/ИНАГРО_ВводСведенийДляРасчетаСтраховогоСтажа/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);	
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения); 	
					
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ИНАГРО_ЗарплатаКадрыРасширенный.ЗаполнитьФизЛицо(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
		
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка); 	
	
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(Режим);
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();
	
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда		
	
		Если НЕ Отказ Тогда
			ВыборкаПоСтраховойСтаж = СформироватьЗапросПоСтраховойСтаж().Выбрать();
			ПроверитьЗаполнениеТабличнойЧасти(ВыборкаПоСтраховойСтаж, Отказ, Заголовок);
		КонецЕсли;	
		Если НЕ Отказ Тогда
			ВыборкаПоСтраховойСтаж.Сбросить();
			//ВыборкаПоСтраховойСтаж = СформироватьЗапросПоСтраховойСтаж().Выбрать();
			// Заполним записи в наборах записей регистров
			ДобавитьСтрокуВДвиженияПоРегиструСведений(ВыборкаПоШапкеДокумента, ВыборкаПоСтраховойСтаж);
		КонецЕсли;
		
	КонецЕсли;
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКЗаписиДвижений(ЭтотОбъект); 

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь(); 
		
КонецПроцедуры

#КонецОбласти

#Область Проведение

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке(Режим)

	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВводСведенийДляРасчетаСтраховогоСтажа.Дата КАК Дата,
		|	ВводСведенийДляРасчетаСтраховогоСтажа.Организация КАК Организация,
		|	ВводСведенийДляРасчетаСтраховогоСтажа.Сотрудник КАК Сотрудник,
		|	ВводСведенийДляРасчетаСтраховогоСтажа.Ссылка КАК Ссылка,
		|	ВводСведенийДляРасчетаСтраховогоСтажа.ПериодС КАК ПериодС,
		|	ВводСведенийДляРасчетаСтраховогоСтажа.ПериодПо КАК ПериодПо
		|ИЗ
		|	Документ.ИНАГРО_ВводСведенийДляРасчетаСтраховогоСтажа КАК ВводСведенийДляРасчетаСтраховогоСтажа
		|ГДЕ
		|	ВводСведенийДляРасчетаСтраховогоСтажа.Ссылка = &ДокументСсылка";
	
	Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);

	Возврат Запрос.Выполнить();

КонецФункции

// Формирует запрос по таблице "РаботникиОрганизации" документа
//
// Параметры: 
//	Режим - режим проведения
//
// Возвращаемое значение:
//	Результат запроса. В запросе данные документа дополняются значениями
//	проверяемых параметров из связанного с
//
Функция СформироватьЗапросПоСтраховойСтаж()
	
	Запрос = Новый Запрос;	
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.Ссылка,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.НомерСтроки,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.Год,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.Месяц1,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.Месяц2,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.Месяц3,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.Месяц4,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.Месяц5,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.Месяц6,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.Месяц7,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.Месяц8,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.Месяц9,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.Месяц10,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.Месяц11,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.Месяц12,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.ВсегоМесяцев,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.ВсегоДней,
		|	ВЫБОР
		|		КОГДА ГОД(&ПериодС) = ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.Год
		|				И МЕСЯЦ(&ПериодС) > 1
		|			ТОГДА ЛОЖЬ
		|		КОГДА ГОД(&ПериодПо) = ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.Год
		|				И МЕСЯЦ(&ПериодПо) < 12
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК УчитыватьИтогиГода,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.ПолныйМесяц1,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.ПолныйМесяц2,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.ПолныйМесяц3,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.ПолныйМесяц4,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.ПолныйМесяц5,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.ПолныйМесяц6,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.ПолныйМесяц7,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.ПолныйМесяц8,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.ПолныйМесяц9,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.ПолныйМесяц10,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.ПолныйМесяц11,
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.ПолныйМесяц12
		|ИЗ
		|	Документ.ИНАГРО_ВводСведенийДляРасчетаСтраховогоСтажа.СтраховойСтаж КАК ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж
		|ГДЕ
		|	ВводСведенийДляРасчетаСтраховогоСтажаСтраховойСтаж.Ссылка = &ДокументСсылка";		
	
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("ПериодС",		ПериодС);
	Запрос.УстановитьПараметр("ПериодПо",		ПериодПо);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры:
//	ВыборкаПоШапкеДокумента - выборка из результата запроса по шапке документа,
//	ВыборкаПоРаботникиОрганизации
//
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегиструСведений(ВыборкаПоШапкеДокумента, ВыборкаПоСтраховойСтаж)

	Пока ВыборкаПоСтраховойСтаж.Следующий() Цикл
		
		Для НомерМесяца = 1 По 12 Цикл
			
			МесяцЗаписи = Дата(ВыборкаПоСтраховойСтаж.Год, НомерМесяца, 1);
			Если МесяцЗаписи >= ВыборкаПоШапкеДокумента.ПериодС И МесяцЗаписи <= ВыборкаПоШапкеДокумента.ПериодПо Тогда
				Движение = Движения.ИНАГРО_СтраховойСтажПоДаннымПФУ.Добавить();
				// Свойства
				Движение.Период	= Дата;
				// Измерения
				Движение.Физлицо		= ВыборкаПоШапкеДокумента.Сотрудник.ФизическоеЛицо;
				Движение.Организация	= ВыборкаПоШапкеДокумента.Организация;
				Движение.Год			= ВыборкаПоСтраховойСтаж.Год;
				Движение.Месяц			= МесяцЗаписи;
				// Ресурсы
				Движение.ДниСтажа		= ВыборкаПоСтраховойСтаж["Месяц"+НомерМесяца];
				Если ВыборкаПоСтраховойСтаж["ПолныйМесяц"+НомерМесяца] = 1 Тогда
					Движение.МесяцыСтажа = 1
				Иначе
					Движение.МесяцыСтажа = 0
				КонецЕсли;	
			КонецЕсли;
			
		КонецЦикла;
		
		Если ВыборкаПоСтраховойСтаж.УчитыватьИтогиГода Тогда
			
			Движение = Движения.ИНАГРО_СтраховойСтажПоДаннымПФУ.Добавить();
			Движение.Период	= Дата;
			// Измерения
			Движение.Физлицо		= ВыборкаПоШапкеДокумента.Сотрудник.ФизическоеЛицо;
			Движение.Организация	= ВыборкаПоШапкеДокумента.Организация;
			// Ресурсы
			Движение.Год			= ВыборкаПоСтраховойСтаж.Год;
			Движение.ДниСтажа		= ВыборкаПоСтраховойСтаж.ВсегоДней;
			Движение.МесяцыСтажа	= ВыборкаПоСтраховойСтаж.ВсегоМесяцев;
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

// Проверяет правильность заполнения табличной части документа.
// Если год в строке табличной части не входит в период справки полностью, 
// а стаж введен только итоговой суммой, то выставляется флаг отказа в проведении.
// Для строк, соответствующих годам, не входящим полностью в период справки, стаж должен вводиться помесячно.
//
// Параметры:
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ					- флаг отказа в проведении.
//	Заголовок				- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеТабличнойЧасти(ВыборкаПоТабличнойЧастиДокумента, Отказ, Заголовок)

	Пока ВыборкаПоТабличнойЧастиДокумента.Следующий() Цикл
		Если Не ВыборкаПоТабличнойЧастиДокумента.УчитыватьИтогиГода Тогда
			ЧислоДнейПомесячно = 0;
			ЧислоДнейПомесячно = ВыборкаПоТабличнойЧастиДокумента.Месяц1 + ВыборкаПоТабличнойЧастиДокумента.Месяц2 + ВыборкаПоТабличнойЧастиДокумента.Месяц3 +
								 ВыборкаПоТабличнойЧастиДокумента.Месяц4 + ВыборкаПоТабличнойЧастиДокумента.Месяц5 + ВыборкаПоТабличнойЧастиДокумента.Месяц6 +
								 ВыборкаПоТабличнойЧастиДокумента.Месяц7 + ВыборкаПоТабличнойЧастиДокумента.Месяц8 + ВыборкаПоТабличнойЧастиДокумента.Месяц9 +
								 ВыборкаПоТабличнойЧастиДокумента.Месяц10 + ВыборкаПоТабличнойЧастиДокумента.Месяц11 + ВыборкаПоТабличнойЧастиДокумента.Месяц12;
			Если ЧислоДнейПомесячно = 0 и (ВыборкаПоТабличнойЧастиДокумента.ВсегоМесяцев > 0 Или ВыборкаПоТабличнойЧастиДокумента.ВсегоДней > 0) Тогда
				ОбщегоНазначенияБПКлиентСервер.СообщитьОбОшибке(НСтр("ru='В строке №" + ВыборкаПоТабличнойЧастиДокумента.НомерСтроки + " год не входит в период справки полностью, заполните стаж помесячно';uk='В рядку №" + ВыборкаПоТабличнойЧастиДокумента.НомерСтроки + " рік не входить в період довідки повністю, заповніть стаж помісячно'"), Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧасти()

#КонецОбласти

#КонецЕсли
